def print_pack_report(kolvo: int):
    """
    Выявляет попал ли ученик в тройку лучших

    Args:
        kolvo (int): Количество пирожных

    Returns:
        str: Можно ли расфасовать данное количество
             и каким способом

    Raises:
        ValueError: Если введен текст неправильного формата

    Example:
    если число делится и на 5, и на 3, выведите число, дефис и фразу «расфасуем по 3 или по 5»:
    • 30 - расфасуем по 3 или по 5
    если число делится на 5, но не делится на 3, выведите число, дефис и фразу «расфасуем по 5»:
    • 10 - расфасуем по 5
    если число делится на 3, но не делится на 5, выведите число, дефис и фразу «расфасуем по 3»:
    • 9 - расфасуем по 3
    в остальных случаях выведите через пробелы число, дефис и фразу «не заказываем!»:
    • 14 - не заказываем!
    """

    # Перебираем все целые числа в порядке убывания —
    # от переданного в функцию числа до единицы.
    for i in range(kolvo, 1, -1):
        if i % 5 == 0 and i % 3 == 0:
            print(f'{i} - расфасуем по 3 или по 5')
        elif i % 5 != 0 and i % 3 == 0:
            print(f'{i} - расфасуем по 3')
        elif i % 5 == 0 and i % 3 != 0:
            print(f'{i} - расфасуем по 5')
        elif i % 5 != 0 and i % 3 != 0:
            print(f'{i} - не заказываем!')

# Тест
print_pack_report(20)